In [1]:
# creating dummy variables to convert categorical into numeric values

# mylist = list(train1.select_dtypes(include=['object']).columns)

# dummies = pd.get_dummies(train[mylist], prefix= mylist)

# train.drop(mylist, axis=1, inplace = True)

# X = pd.concat([train,dummies], axis =1 )

# One Hot Encoding with multiple Features

In [8]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [4]:
cd Data

D:\JUPYTER\Data

In [5]:
pwd

'D:\\JUPYTER\\Data'

In [6]:
df = pd.read_csv('titanic.csv')

In [7]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [16]:
df.embark_town.value_counts().sort_values(ascending=False).head()

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [13]:
## Here we are finding three categories we will try to select top 2 categories

In [15]:
top_2 = [x for x in df.embark_town.value_counts().sort_values(ascending=False).head(2).index]
top_2

['Southampton', 'Cherbourg']

In [18]:
for label in top_2:
    df[label] = np.where(df.embark_town==label,1,0)
    
df[['embark_town']+top_2].head(10)

   embark_town  Southampton  Cherbourg
0  Southampton            1          0
1    Cherbourg            0          1
2  Southampton            1          0
3  Southampton            1          0
4  Southampton            1          0
5   Queenstown            0          0
6  Southampton            1          0
7  Southampton            1          0
8  Southampton            1          0
9    Cherbourg            0          1

# Mean Encoding

In [19]:
data={'SubjectName':['s1','s2','s3','s1','s4','s3','s2','s1','s2','s4','s1'], 
      'Target':[1,0,1,1,1,0,0,1,1,1,0]}

In [20]:
df = pd.DataFrame(data)

In [21]:
df.head()

  SubjectName  Target
0          s1       1
1          s2       0
2          s3       1
3          s1       1
4          s4       1

In [22]:
df.groupby(['SubjectName'])['Target'].count()

SubjectName
s1    4
s2    3
s3    2
s4    2
Name: Target, dtype: int64

In [23]:
df.groupby(['SubjectName'])['Target'].mean()

SubjectName
s1    0.750000
s2    0.333333
s3    0.500000
s4    1.000000
Name: Target, dtype: float64

In [24]:
Mean_encoded_subject = df.groupby(['SubjectName'])['Target'].mean().to_dict() 

df['SubjectName'] = df['SubjectName'].map(Mean_encoded_subject) 

print(df)

    SubjectName  Target
0      0.750000       1
1      0.333333       0
2      0.500000       1
3      0.750000       1
4      1.000000       1
5      0.500000       0
6      0.333333       0
7      0.750000       1
8      0.333333       1
9      1.000000       1
10     0.750000       0